module.exports.config = {
	name: "nastik",
  version: "1.0.0",
  permission: 1,
  credits: "SIDDIK",
  description: "NASTIK DOMON",
  prefix: true, 
  category: "addmin", 
  usages: "addmin",
  cooldowns: 5,
  dependencies: {
    "request":"",
    "fs-extra":"",
    "axios":""
  }
};
 
module.exports.run = async function({ api, args, Users, event}) {
  var mention = Object.keys(event.mentions)[0];
  if(!mention) return api.sendMessage("যেই নাস্তিক কে শিক্ষা দিতে চান তাকে @ম্যানশন দেও", event.threadID);
let name =  event.mentions[mention];
  var arraytag = [];
      arraytag.push({id: mention, tag: name});
  var a = function (a) { api.sendMessage(a, event.threadID); }
a("বজ্জাত নাস্তিক");
setTimeout(() => {a({body: "তর মতো ফাজিল পলা পাইন এই প্রথম দেখলাম-!!😈।" + " " + name, mentions: arraytag})}, 3000);
setTimeout(() => {a({body: "টোকাই পলা পাইন-!!😹.." + " " + name, mentions: arraytag})}, 5000);
setTimeout(() => {a({body: "নাস্তিকদের জায়গায় নাই তদের মতো নাস্তিক কে পেলে হাতে পায়ের রগ কেতে দিতাম-!!🩸🪓" + " " + name, mentions: arraytag})}, 7000);
setTimeout(() => {a({body: "দুরব চাওয়া মর তোর মতো ফাজিল আমাদের গ্রুপ এ থাকার যোগ্য-!!😹😈" + " " + name, mentions: arraytag})}, 9000);
setTimeout(() => {a({body: "কামলা পলা পাইন কামলা দিবি দে এতো নাটক  কসর কেনো-!!😹" + " " + name, mentions: arraytag})}, 12000);
setTimeout(() => {a({body: "তুই তরা মা বাবার জারজ সন্তান-!!😈" + " " + name, mentions: arraytag})}, 15000);
setTimeout(() => {a({body: "বাপ চিনে লাগতে আসিস না হলে পরে আপসস করতে হবে-!!😈😹" + " " + name, mentions: arraytag})}, 17000);
setTimeout(() => {a({body: "ফাইলাম করি ভালো কথা তুই তর বাপের সাথে লাগতে আসবি কেনো রে নাস্তিক-!!🤬😈" + " " + name, mentions: arraytag})}, 20000);
setTimeout(() => {a({body: "তুই এতো টা খারাপ যে তোকে দেখে জাহান্নাম ও ভয়ে কান্না করছে-!!🙂" + " " + name, mentions: arraytag})},23000);
setTimeout(() => {a({body: "সময় থাকতে মানুষ হয়ে যা না হলে তরে আমাদের মানুষ করতে হবে-!!😈।" + " " + name, mentions: arraytag})}, 25000);
setTimeout(() => {a({body: "ভিক্ষা করে তর জীবন চলে আর তুই আসছোট বাবাদের সাথে লাগতে-!!😈।" + " " + name, mentions: arraytag})}, 28500);
setTimeout(() => {a({body: "দিন রাত হাত মাইরা বলস তুই পাপি নাহ তুই ভালো মানুষ-!!😹" + " " + name, mentions: arraytag})},31000);
setTimeout(() => {a({body: "টোকাই পলা পাইন আমাদের ডাস্টবিনের ময়লা আবর্জনা টুকিয়ে তর জীবন চলে আর তুই আমাদের উপরে আসস কথা বলতে-!!😹 " + " " + name, mentions: arraytag})}, 36000);
setTimeout(() => {a("থাপ্পর খাবি তো বাপ চিনবি-!!😹")} , 39000);
setTimeout(() => {a({body: "ভিক্ষা মাইংগা খাস আবার বড়ো বড়ো কথা বলস সরম করে নাহ নাস্তিক-!!😹।" + " " + name, mentions: arraytag})}, 42000);
setTimeout(() => {a({body: "আমার ইসলাম এর সাথে লাগতে আসিস নাহ তোর জীবন এক থাপ্পড়ে শেষ করে দিবো" + " " + name, mentions: arraytag})}, 48000);
setTimeout(() => {a({body: "তর মতো নাস্তিক আমাদের পা চেটে খায় আর তুই আমাদের সাথে লাগতে আসোস-!!😹😈" + " " + name, mentions: arraytag})}, 51000);
setTimeout(() => {a({body: "আমাদের নামে উল্টো পালটা কথা বইলা তর জীবন নিয়ে টানা টানি করিস নাহ-!!😹" + " " + name, mentions: arraytag})}, 54000);
setTimeout(() => {a({body: "আমাদের পা চেটে খাওয়া পোলা পাইন আমাদের সাথে লাগতে আসবি-!!😈🤬" + " " + name, mentions: arraytag})}, 57000);
setTimeout(() => {a({body: "বাইমানি করি তাও আবার আমাদের সাথে তর নাম পরিবর্তন করে দিমু আসিস আমাদের এই খানে-!!😹" + " " + name, mentions: arraytag})}, 59400);
setTimeout(() => {a({body: "দিন রাত নেসা পানি খারাপ কাজ করে তুই বলিস মুমিন বান্দা-!!😹" + " " + name, mentions: arraytag})}, 63000);
setTimeout(() => {a({body: "তর মতো নাফরমানি বান্ধা আমাদের বাল এর জজ্ঞ নাহ-!!😹" + " " + name, mentions: arraytag})}, 66000);
setTimeout(() => {a({body: "তুই খারাপ কাজ করে আমাদের সাথে লাগতে আসবি তর হার গুরো করে দিবো-!!🦴😹" + " " + name, mentions: arraytag})},69000);
setTimeout(() => {a({body: "গালা গালি করবি তো মুখ শিলাই করে দিমহ-!!😁😷।" + " " + name, mentions: arraytag})}, 72000);
setTimeout(() => {a({body: "তোর মুখে ভাতরুমের গন্ধ যা আগে দাত মেঝে আয় পরে কথা বলিস-!!😁" + " " + name, mentions: arraytag})}, 75000);
setTimeout(() => {a({body: "তুই লাগবি আমাদের সাথে আসিস তোর জা আছে এখন পরে তা নিয়েও ফিরতে পারবি নাহ-!!😁" + " " + name, mentions: arraytag})},81000);
setTimeout(() => {a({body: " বাস্ট্রাড এর বাচ্ছা বস্তির পোলা-!!🤧🤮 " + " " + name, mentions: arraytag})}, 87000);
setTimeout(() => {a("তর মা বাবার জারজ শন্তান-!!🤬😈")} , 93000);
setTimeout(() => {a({body: "তর মতো নাস্তিক পশুর থেকে নিক্রিসঠো-!!😈" + " " + name, mentions: arraytag})}, 99000);
setTimeout(() => {a({body: "তর জন্মদাতা রাস্তার কুত্তা-!!🤧😹" + " " + name, mentions: arraytag})}, 105000);
setTimeout(() => {a({body: "তুই কিত্তা তাই কুত্তার মতো শুধু গেও গেও করস-!!😹" + " " + name, mentions: arraytag})}, 111000);
setTimeout(() => {a({body: "তোর হয়তো জানা নেই ইসলাম কি জিনিস  ইসলাম এর পাওয়ার কতো টুকু-!!😎⚡⛈️" + " " + name, mentions: arraytag})}, 114000);
setTimeout(() => {a({body: "সেই দিন কার কামলা পলা পাইন-!!😁 " + " " + name, mentions: arraytag})}, 120000);
setTimeout(() => {a({body: "জুয়ারি গাঞ্জুটি পোলা পাইন ইসলামিক গ্রুপ এ থাকার জজ্ঞ নাহ-!!🤬 " + " " + name, mentions: arraytag})}, 126000);
setTimeout(() => {a({body: "বস্তির ছেলে অনলাইনের কিং-!!😹" + " " + name, mentions: arraytag})}, 132000);
setTimeout(() => {a({body: "তুই টোকাই কিং-!!😹" + " " + name, mentions: arraytag})}, 138000);
setTimeout(() => {a({body: "টাকার অভাবে মরা গরু খাস-!!😹" + " " + name, mentions: arraytag})},144000);
setTimeout(() => {a({body: "টোকাই সেলিব্রেটি-!!😹" + " " + name, mentions: arraytag})}, 150000);
setTimeout(() => {a({body: "ভাত খাইবার ভাত পাস না আর কথা বলতে আসোস আমাদের সাথে-!!😹" + " " + name, mentions: arraytag})}, 156000);
setTimeout(() => {a({body: "ফকিন্নি পোলাপান-!!😹" + " " + name, mentions: arraytag})},162000);
setTimeout(() => {a({body: " বস্তিরন্দালাল এর বাচ্ছা বস্তির পোলা-!!😹 " + " " + name, mentions: arraytag})}, 168000);
setTimeout(() => {a("জারজ শন্তান জা ভাগ-!!😹😈")} , 171000);
setTimeout(() => {a({body: "hare is বস্তি পোলা-!!😹" + " " + name, mentions: arraytag})}, 174000);
setTimeout(() => {a({body: "বান্তেয়ামি করার জায়গা পাস না-!!🤬" + " " + name, mentions: arraytag})}, 177000);
setTimeout(() => {a({body: "লাগতে আসিস নাহ ভারচুয়াল জগত হারাম করে দিমু-!!🤬😈" + " " + name, mentions: arraytag})}, 180000);
setTimeout(() => {a({body: "আব্বা ডাক তাহলে মানুষ হবার ট্রিক বলে দিমু-!!😹" + " " + name, mentions: arraytag})}, 9000);
setTimeout(() => {a({body: "আর বাপের সাথে লাগতে আসবি-!!😾😈" + " " + name, mentions: arraytag})}, 12000);
setTimeout(() => {a({body: "ঠাপ খাবি বাপ চিনবি-!!😹😈" + " " + name, mentions: arraytag})}, 15000);
setTimeout(() => {a({body: "তেরামি করবি গার মটকে দিবো-!!🤬😈" + " " + name, mentions: arraytag})}, 17000);
setTimeout(() => {a({body: "বারা বারি করবি তর বন রে নিয়ে পালাবো-!!🤧😈" + " " + name, mentions: arraytag})}, 20000);
setTimeout(() => {a({body: "বারা বারি করবি তোর মুখে হাইগ্যা দিমু-!!🤮😹" + " " + name, mentions: arraytag})},23000);
setTimeout(() => {a({body: "পাকনাকি করবি গু এর সাগরে ডুবাইয়া মারমু-!!😹🤮" + " " + name, mentions: arraytag})}, 25000);
setTimeout(() => {a({body: "তর রাতে আকাম করার ভিডিও ভাইরাল করে দিমু বারা বারি করবি তো-!!😹🤧" + " " + name, mentions: arraytag})}, 28500);
setTimeout(() => {a({body: "বেয়াদব দের সাথে কথা বলতে চাই না দূরে যাইয়া মর-!!🤧🤮" + " " + name, mentions: arraytag})},31000);
setTimeout(() => {a({body: "বেশি কাহিনি করবি তর বন রে নিয়ে কাহিনি বানিয়ে দিমু-!!😹 " + " " + name, mentions: arraytag})}, 36000);
setTimeout(() => {a("তুই কই তর বন এর টুনটুনি সই-!!😹🥵")} , 39000);
setTimeout(() => {a({body: "পালাইস নাহ পালাইস নাহ এমন ঠাপ দিমু পালানো জায়গায় পাবি না-!!😹" + " " + name, mentions: arraytag})}, 3000);
setTimeout(() => {a({body: "তোর চিকোন সুন্দরী বন কে উম্মাহ-!!😹💋" + " " + name, mentions: arraytag})}, 5000);
setTimeout(() => {a({body: "বারি বারি করবি তোর বউ রে নিয়ে খেলমু পাট খেতে নিয়ে-!!😹" + " " + name, mentions: arraytag})}, 7000);
setTimeout(() => {a({body: "গালা গালি ৪২০ পাতার নাম পুদিনা তো মতো কা।লা পোলা পাইন চু**না-!!😈😹" + " " + name, mentions: arraytag})}, 9000);
setTimeout(() => {a({body: "হট করে দিমু তর বন রে তেরামি করবি তো-!!😹🥵। " + " " + name, mentions: arraytag})}, 12000);
setTimeout(() => {a({body: "৯৯৯ এই নুম্বার এ কল দে তর বন রে কিডনাপ করমু-!!😹" + " " + name, mentions: arraytag})}, 15000);
setTimeout(() => {a({body: "তেরিং বেরিং করবি তো তর গুসঠি গারমু-!!😹🤬" + " " + name, mentions: arraytag})}, 17000);
setTimeout(() => {a({body: "গু খাওরা নাস্তিক-!!🤮😹" + " " + name, mentions: arraytag})}, 20000);
setTimeout(() => {a({body: "তেল মজামু আসিস-!!😹🤬" + " " + name, mentions: arraytag})},23000);
setTimeout(() => {a({body: "ওজান কুজাত এর জায়গা নাই আমার সহরে-!!🤬😈" + " " + name, mentions: arraytag})}, 25000);
setTimeout(() => {a({body: "তর মতাও নাস্তিক আমাদের সাথে লাগতে আসছে বাহ-!!😹" + " " + name, mentions: arraytag})}, 28500);
setTimeout(() => {a({body: "নাস্তিক এর বাচ্চা হিজলার সাথে তার কাতা-!!🤬🥵" + " " + name, mentions: arraytag})},31000);
setTimeout(() => {a({body: "নাস্তিক এর বাচ্চা এমন ঠাপ দিমু তোর বন রে শুধা লারাইয়া ফেলমু-!!😈🤬" + " " + name, mentions: arraytag})}, 36000);
setTimeout(() => {a("তেরিং বেতিং করবি তোর বন এর জৌবোন নষ্ট করে দিমু-!!🥵😹")} , 39000);
	setTimeout(() => {a("তর মার সাথে রাতে আকাম করগা ভালো না লাগলে-!!🥵🤬")} ,40000);
	setTimeout(() => {a("কিং অফ ফকিন্নির পলা-!!✌️😈 ")} , 41000);
setTimeout(() => {a("কিং অফ ঘু খোর টোকাই পোলা-!!✌️😈 ")} , 42000);
setTimeout(() => {a("next time লাগতে আসার আগে ১০ বার ভাবিস-!!🤬😈 ")} , 41000);
 
 
                     }
 
